ranjithaguna/pv/LED_Demo/source/pic32cx/component/ints.h
/**
 * \brief Component description for PIC32CX/0525SG12 INTS
 *
 * Copyright (c) 2018 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2018-04-24T21:15:30Z */
#ifndef _PIC32CX_0525SG12_INTS_COMPONENT_H_
#define _PIC32CX_0525SG12_INTS_COMPONENT_H_

/** \addtogroup PIC32CX_0525SG12_INTS The interrupt generation logic is made of 16 groups of signals, each of which\n        consist of a Status register, a Enable register and a Result register. The Status and Enable are\n        latched registers. The Result register is a bit by bit AND function of the Source and Enable registers.\n        All the bits of the Result register are OR'ed together and AND'ed with the corresponding bit in the Block\n        Select register to form the interrupt signal that is routed to the ARM interrupt controller.
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR INTS */
/* ========================================================================== */

/* -------- INTS_GIRQ08_SRC : (INTS Offset: 0x00) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ08_SRC_bits_t;
#define INTS_GIRQ08_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ08_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ08_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ08_SRC) Register Mask  */

/* -------- INTS_GIRQ08_EN_SET : (INTS Offset: 0x04) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ08_EN_SET_bits_t;
#define INTS_GIRQ08_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ08_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ08_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ08_EN_SET) Register Mask  */

/* -------- INTS_GIRQ08_RESULT : (INTS Offset: 0x08) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ08_RESULT_bits_t;
#define INTS_GIRQ08_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ08_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ08_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ08_RESULT) Register Mask  */

/* -------- INTS_GIRQ08_EN_CLR : (INTS Offset: 0x0c) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ08_EN_CLR_bits_t;
#define INTS_GIRQ08_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ08_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ08_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ08_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ09_SRC : (INTS Offset: 0x14) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ09_SRC_bits_t;
#define INTS_GIRQ09_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ09_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ09_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ09_SRC) Register Mask  */

/* -------- INTS_GIRQ09_EN_SET : (INTS Offset: 0x18) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ09_EN_SET_bits_t;
#define INTS_GIRQ09_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ09_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ09_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ09_EN_SET) Register Mask  */

/* -------- INTS_GIRQ09_RESULT : (INTS Offset: 0x1c) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ09_RESULT_bits_t;
#define INTS_GIRQ09_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ09_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ09_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ09_RESULT) Register Mask  */

/* -------- INTS_GIRQ09_EN_CLR : (INTS Offset: 0x20) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ09_EN_CLR_bits_t;
#define INTS_GIRQ09_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ09_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ09_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ09_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ10_SRC : (INTS Offset: 0x28) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ10_SRC_bits_t;
#define INTS_GIRQ10_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ10_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ10_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ10_SRC) Register Mask  */

/* -------- INTS_GIRQ10_EN_SET : (INTS Offset: 0x2c) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ10_EN_SET_bits_t;
#define INTS_GIRQ10_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ10_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ10_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ10_EN_SET) Register Mask  */

