ranjithaguna/pv/LED_Demo/source/pic32cx/component/ints.h
/* -------- INTS_GIRQ10_RESULT : (INTS Offset: 0x30) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ10_RESULT_bits_t;
#define INTS_GIRQ10_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ10_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ10_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ10_RESULT) Register Mask  */

/* -------- INTS_GIRQ10_EN_CLR : (INTS Offset: 0x34) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ10_EN_CLR_bits_t;
#define INTS_GIRQ10_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ10_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ10_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ10_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ11_SRC : (INTS Offset: 0x3c) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ11_SRC_bits_t;
#define INTS_GIRQ11_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ11_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ11_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ11_SRC) Register Mask  */

/* -------- INTS_GIRQ11_EN_SET : (INTS Offset: 0x40) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ11_EN_SET_bits_t;
#define INTS_GIRQ11_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ11_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ11_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ11_EN_SET) Register Mask  */

/* -------- INTS_GIRQ11_RESULT : (INTS Offset: 0x44) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ11_RESULT_bits_t;
#define INTS_GIRQ11_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ11_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ11_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ11_RESULT) Register Mask  */

/* -------- INTS_GIRQ11_EN_CLR : (INTS Offset: 0x48) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ11_EN_CLR_bits_t;
#define INTS_GIRQ11_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ11_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ11_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ11_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ12_SRC : (INTS Offset: 0x50) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ12_SRC_bits_t;
#define INTS_GIRQ12_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ12_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ12_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ12_SRC) Register Mask  */

/* -------- INTS_GIRQ12_EN_SET : (INTS Offset: 0x54) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ12_EN_SET_bits_t;
#define INTS_GIRQ12_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ12_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ12_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ12_EN_SET) Register Mask  */

/* -------- INTS_GIRQ12_RESULT : (INTS Offset: 0x58) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ12_RESULT_bits_t;
#define INTS_GIRQ12_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ12_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ12_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ12_RESULT) Register Mask  */

/* -------- INTS_GIRQ12_EN_CLR : (INTS Offset: 0x5c) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ12_EN_CLR_bits_t;
#define INTS_GIRQ12_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ12_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ12_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ12_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ13_SRC : (INTS Offset: 0x64) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ13_SRC_bits_t;
#define INTS_GIRQ13_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ13_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ13_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ13_SRC) Register Mask  */

/* -------- INTS_GIRQ13_EN_SET : (INTS Offset: 0x68) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ13_EN_SET_bits_t;
#define INTS_GIRQ13_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ13_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ13_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ13_EN_SET) Register Mask  */

/* -------- INTS_GIRQ13_RESULT : (INTS Offset: 0x6c) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ13_RESULT_bits_t;
#define INTS_GIRQ13_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ13_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ13_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ13_RESULT) Register Mask  */

/* -------- INTS_GIRQ13_EN_CLR : (INTS Offset: 0x70) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ13_EN_CLR_bits_t;
