ranjithaguna/pv/LED_Demo/source/pic32cx/component/ints.h
#define INTS_GIRQ13_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ13_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ13_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ13_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ14_SRC : (INTS Offset: 0x78) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ14_SRC_bits_t;
#define INTS_GIRQ14_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ14_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ14_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ14_SRC) Register Mask  */

/* -------- INTS_GIRQ14_EN_SET : (INTS Offset: 0x7c) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ14_EN_SET_bits_t;
#define INTS_GIRQ14_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ14_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ14_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ14_EN_SET) Register Mask  */

/* -------- INTS_GIRQ14_RESULT : (INTS Offset: 0x80) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ14_RESULT_bits_t;
#define INTS_GIRQ14_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ14_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ14_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ14_RESULT) Register Mask  */

/* -------- INTS_GIRQ14_EN_CLR : (INTS Offset: 0x84) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ14_EN_CLR_bits_t;
#define INTS_GIRQ14_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ14_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ14_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ14_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ15_SRC : (INTS Offset: 0x8c) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ15_SRC_bits_t;
#define INTS_GIRQ15_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ15_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ15_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ15_SRC) Register Mask  */

/* -------- INTS_GIRQ15_EN_SET : (INTS Offset: 0x90) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ15_EN_SET_bits_t;
#define INTS_GIRQ15_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ15_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ15_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ15_EN_SET) Register Mask  */

/* -------- INTS_GIRQ15_RESULT : (INTS Offset: 0x94) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ15_RESULT_bits_t;
#define INTS_GIRQ15_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ15_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ15_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ15_RESULT) Register Mask  */

/* -------- INTS_GIRQ15_EN_CLR : (INTS Offset: 0x98) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ15_EN_CLR_bits_t;
#define INTS_GIRQ15_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ15_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ15_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ15_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ16_SRC : (INTS Offset: 0xa0) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ16_SRC_bits_t;
#define INTS_GIRQ16_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ16_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ16_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ16_SRC) Register Mask  */

/* -------- INTS_GIRQ16_EN_SET : (INTS Offset: 0xa4) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ16_EN_SET_bits_t;
#define INTS_GIRQ16_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ16_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ16_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ16_EN_SET) Register Mask  */

/* -------- INTS_GIRQ16_RESULT : (INTS Offset: 0xa8) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ16_RESULT_bits_t;
#define INTS_GIRQ16_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ16_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ16_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ16_RESULT) Register Mask  */

/* -------- INTS_GIRQ16_EN_CLR : (INTS Offset: 0xac) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ16_EN_CLR_bits_t;
#define INTS_GIRQ16_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ16_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ16_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ16_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ17_SRC : (INTS Offset: 0xb4) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ17_SRC_bits_t;
#define INTS_GIRQ17_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ17_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ17_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ17_SRC) Register Mask  */

