ranjithaguna/pv/LED_Demo/source/pic32cx/component/ints.h
/* -------- INTS_GIRQ17_EN_SET : (INTS Offset: 0xb8) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ17_EN_SET_bits_t;
#define INTS_GIRQ17_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ17_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ17_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ17_EN_SET) Register Mask  */

/* -------- INTS_GIRQ17_RESULT : (INTS Offset: 0xbc) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ17_RESULT_bits_t;
#define INTS_GIRQ17_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ17_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ17_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ17_RESULT) Register Mask  */

/* -------- INTS_GIRQ17_EN_CLR : (INTS Offset: 0xc0) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ17_EN_CLR_bits_t;
#define INTS_GIRQ17_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ17_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ17_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ17_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ18_SRC : (INTS Offset: 0xc8) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ18_SRC_bits_t;
#define INTS_GIRQ18_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ18_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ18_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ18_SRC) Register Mask  */

/* -------- INTS_GIRQ18_EN_SET : (INTS Offset: 0xcc) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ18_EN_SET_bits_t;
#define INTS_GIRQ18_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ18_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ18_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ18_EN_SET) Register Mask  */

/* -------- INTS_GIRQ18_RESULT : (INTS Offset: 0xd0) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ18_RESULT_bits_t;
#define INTS_GIRQ18_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ18_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ18_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ18_RESULT) Register Mask  */

/* -------- INTS_GIRQ18_EN_CLR : (INTS Offset: 0xd4) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ18_EN_CLR_bits_t;
#define INTS_GIRQ18_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ18_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ18_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ18_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ19_SRC : (INTS Offset: 0xdc) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ19_SRC_bits_t;
#define INTS_GIRQ19_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ19_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ19_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ19_SRC) Register Mask  */

/* -------- INTS_GIRQ19_EN_SET : (INTS Offset: 0xe0) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ19_EN_SET_bits_t;
#define INTS_GIRQ19_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ19_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ19_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ19_EN_SET) Register Mask  */

/* -------- INTS_GIRQ19_RESULT : (INTS Offset: 0xe4) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ19_RESULT_bits_t;
#define INTS_GIRQ19_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ19_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ19_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ19_RESULT) Register Mask  */

/* -------- INTS_GIRQ19_EN_CLR : (INTS Offset: 0xe8) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ19_EN_CLR_bits_t;
#define INTS_GIRQ19_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ19_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ19_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ19_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ20_SRC : (INTS Offset: 0xf0) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ20_SRC_bits_t;
#define INTS_GIRQ20_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ20_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ20_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ20_SRC) Register Mask  */

/* -------- INTS_GIRQ20_EN_SET : (INTS Offset: 0xf4) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ20_EN_SET_bits_t;
#define INTS_GIRQ20_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ20_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ20_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ20_EN_SET) Register Mask  */

/* -------- INTS_GIRQ20_RESULT : (INTS Offset: 0xf8) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ20_RESULT_bits_t;
#define INTS_GIRQ20_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ20_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

