ranjithaguna/pv/LED_Demo/source/pic32cx/component/ints.h
#define INTS_GIRQ20_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ20_RESULT) Register Mask  */

/* -------- INTS_GIRQ20_EN_CLR : (INTS Offset: 0xfc) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ20_EN_CLR_bits_t;
#define INTS_GIRQ20_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ20_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ20_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ20_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ21_SRC : (INTS Offset: 0x104) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ21_SRC_bits_t;
#define INTS_GIRQ21_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ21_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ21_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ21_SRC) Register Mask  */

/* -------- INTS_GIRQ21_EN_SET : (INTS Offset: 0x108) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ21_EN_SET_bits_t;
#define INTS_GIRQ21_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ21_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ21_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ21_EN_SET) Register Mask  */

/* -------- INTS_GIRQ21_RESULT : (INTS Offset: 0x10c) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ21_RESULT_bits_t;
#define INTS_GIRQ21_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ21_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ21_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ21_RESULT) Register Mask  */

/* -------- INTS_GIRQ21_EN_CLR : (INTS Offset: 0x110) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ21_EN_CLR_bits_t;
#define INTS_GIRQ21_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ21_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ21_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ21_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ22_SRC : (INTS Offset: 0x118) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ22_SRC_bits_t;
#define INTS_GIRQ22_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ22_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ22_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ22_SRC) Register Mask  */

/* -------- INTS_GIRQ22_EN_SET : (INTS Offset: 0x11c) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ22_EN_SET_bits_t;
#define INTS_GIRQ22_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ22_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ22_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ22_EN_SET) Register Mask  */

/* -------- INTS_GIRQ22_RESULT : (INTS Offset: 0x120) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ22_RESULT_bits_t;
#define INTS_GIRQ22_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ22_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ22_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ22_RESULT) Register Mask  */

/* -------- INTS_GIRQ22_EN_CLR : (INTS Offset: 0x124) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ22_EN_CLR_bits_t;
#define INTS_GIRQ22_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ22_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ22_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ22_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ23_SRC : (INTS Offset: 0x12c) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ23_SRC_bits_t;
#define INTS_GIRQ23_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ23_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ23_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ23_SRC) Register Mask  */

/* -------- INTS_GIRQ23_EN_SET : (INTS Offset: 0x130) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ23_EN_SET_bits_t;
#define INTS_GIRQ23_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ23_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ23_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ23_EN_SET) Register Mask  */

/* -------- INTS_GIRQ23_RESULT : (INTS Offset: 0x134) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ23_RESULT_bits_t;
#define INTS_GIRQ23_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ23_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ23_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ23_RESULT) Register Mask  */

/* -------- INTS_GIRQ23_EN_CLR : (INTS Offset: 0x138) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ23_EN_CLR_bits_t;
#define INTS_GIRQ23_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ23_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ23_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ23_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ24_SRC : (INTS Offset: 0x140) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ24_SRC_bits_t;
