ranjithaguna/pv/LED_Demo/source/pic32cx/component/ints.h
#define INTS_GIRQ24_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ24_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ24_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ24_SRC) Register Mask  */

/* -------- INTS_GIRQ24_EN_SET : (INTS Offset: 0x144) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ24_EN_SET_bits_t;
#define INTS_GIRQ24_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ24_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ24_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ24_EN_SET) Register Mask  */

/* -------- INTS_GIRQ24_RESULT : (INTS Offset: 0x148) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ24_RESULT_bits_t;
#define INTS_GIRQ24_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ24_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ24_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ24_RESULT) Register Mask  */

/* -------- INTS_GIRQ24_EN_CLR : (INTS Offset: 0x14c) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ24_EN_CLR_bits_t;
#define INTS_GIRQ24_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ24_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ24_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ24_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ25_SRC : (INTS Offset: 0x154) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ25_SRC_bits_t;
#define INTS_GIRQ25_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ25_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ25_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ25_SRC) Register Mask  */

/* -------- INTS_GIRQ25_EN_SET : (INTS Offset: 0x158) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ25_EN_SET_bits_t;
#define INTS_GIRQ25_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ25_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ25_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ25_EN_SET) Register Mask  */

/* -------- INTS_GIRQ25_RESULT : (INTS Offset: 0x15c) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ25_RESULT_bits_t;
#define INTS_GIRQ25_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ25_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ25_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ25_RESULT) Register Mask  */

/* -------- INTS_GIRQ25_EN_CLR : (INTS Offset: 0x160) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ25_EN_CLR_bits_t;
#define INTS_GIRQ25_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ25_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ25_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ25_EN_CLR) Register Mask  */

/* -------- INTS_GIRQ26_SRC : (INTS Offset: 0x168) (R/W 32) Status R/W1C -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ26_SRC_bits_t;
#define INTS_GIRQ26_SRC_RESETVALUE          (0x00U)                                       /**<  (INTS_GIRQ26_SRC) Status R/W1C  Reset Value */

#define INTS_GIRQ26_SRC_Msk                   (0x00000000UL)                                 /**< (INTS_GIRQ26_SRC) Register Mask  */

/* -------- INTS_GIRQ26_EN_SET : (INTS Offset: 0x16c) (R/W 32) Write to set source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ26_EN_SET_bits_t;
#define INTS_GIRQ26_EN_SET_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ26_EN_SET) Write to set source enables  Reset Value */

#define INTS_GIRQ26_EN_SET_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ26_EN_SET) Register Mask  */

/* -------- INTS_GIRQ26_RESULT : (INTS Offset: 0x170) (R/ 32) Read-only bitwise OR of Source and Enable -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ26_RESULT_bits_t;
#define INTS_GIRQ26_RESULT_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ26_RESULT) Read-only bitwise OR of Source and Enable  Reset Value */

#define INTS_GIRQ26_RESULT_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ26_RESULT) Register Mask  */

/* -------- INTS_GIRQ26_EN_CLR : (INTS Offset: 0x174) (R/W 32) Write to clear source enables -------- */

typedef union
{
  uint32_t w;
} __INTS_GIRQ26_EN_CLR_bits_t;
#define INTS_GIRQ26_EN_CLR_RESETVALUE       (0x00U)                                       /**<  (INTS_GIRQ26_EN_CLR) Write to clear source enables  Reset Value */

#define INTS_GIRQ26_EN_CLR_Msk                (0x00000000UL)                                 /**< (INTS_GIRQ26_EN_CLR) Register Mask  */

/* -------- INTS_BLOCK_ENABLE_SET : (INTS Offset: 0x200) (R/W 32) Block Enable Set Register -------- */

typedef union
{
  struct
  {
    uint32_t IRQ_VECTOR_ENABLE_SET:31;  /**< bit:  0..30  Each GIRQx bit can be individually enabled to assert an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WS)\n      1=Interrupts in the GIRQx Source Register may be enabled\n      0=No effect. */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __INTS_BLOCK_ENABLE_SET_bits_t;
#define INTS_BLOCK_ENABLE_SET_RESETVALUE    (0x00U)                                       /**<  (INTS_BLOCK_ENABLE_SET) Block Enable Set Register  Reset Value */

#define INTS_BLOCK_ENABLE_SET_IRQ_VECTOR_ENABLE_SET_Pos (0)                                            /**< (INTS_BLOCK_ENABLE_SET) Each GIRQx bit can be individually enabled to assert an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WS)\n      1=Interrupts in the GIRQx Source Register may be enabled\n      0=No effect. Position */
#define INTS_BLOCK_ENABLE_SET_IRQ_VECTOR_ENABLE_SET_Msk (0x7FFFFFFFU << INTS_BLOCK_ENABLE_SET_IRQ_VECTOR_ENABLE_SET_Pos)  /**< (INTS_BLOCK_ENABLE_SET) Each GIRQx bit can be individually enabled to assert an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WS)\n      1=Interrupts in the GIRQx Source Register may be enabled\n      0=No effect. Mask */
#define INTS_BLOCK_ENABLE_SET_IRQ_VECTOR_ENABLE_SET(value) (INTS_BLOCK_ENABLE_SET_IRQ_VECTOR_ENABLE_SET_Msk & ((value) << INTS_BLOCK_ENABLE_SET_IRQ_VECTOR_ENABLE_SET_Pos))
#define INTS_BLOCK_ENABLE_SET_Msk             (0x7FFFFFFFUL)                                 /**< (INTS_BLOCK_ENABLE_SET) Register Mask  */

/* -------- INTS_BLOCK_ENABLE_CLEAR : (INTS Offset: 0x204) (R/W 32) Block Enable Clear Register. -------- */

typedef union
{
  struct
  {
    uint32_t IRQ_VECTOR_ENABLE_CLEAR:31;  /**< bit:  0..30  Each GIRQx bit can be individually disabled to inhibit an interrupt event.\n      Reads always return the current value of the internal GIRQX_ENABLE bit. The state of the GIRQX_ENABLE bit is determined by\n      the corresponding GIRQX_ENABLE_SET bit and the GIRQX_ENABLE_CLEAR bit. (0=disabled, 1=enabled) (R/WC)\n      1=All interrupts in the GIRQx Source Register are disabled\n      0=No effect. */
    uint32_t :1;                        /**< bit:     31  Reserved                                      */
  };
  uint32_t w;
} __INTS_BLOCK_ENABLE_CLEAR_bits_t;
#define INTS_BLOCK_ENABLE_CLEAR_RESETVALUE  (0x00U)                                       /**<  (INTS_BLOCK_ENABLE_CLEAR) Block Enable Clear Register.  Reset Value */

